app/Validation/AccountRules.php

  public function validateAccount(string $str, string $fields, array $data){
    $account = $this->account->where('email', $data['email'])
                  ->first();
---
SELECT *
FROM `accounts`
WHERE `email` = 'admin@mail.com'
 LIMIT 1