app/Controllers/Admin.php

SELECT COUNT(*) AS `numrows`
FROM `accounts`
WHERE `access` = 'operator'
SELECT COUNT(*) AS `numrows`
FROM `accounts`
WHERE `access` = 'super_agent'
SELECT COUNT(*) AS `numrows`
FROM `accounts`
WHERE `access` = 'agent'
---
        }

        if($var == 'dashboard'){
            $data['operators'] = $this->account->where('access', 'operator')->countAllResults();
            $data['super_agents'] = $this->account->where('access', 'super_agent')->countAllResults();
            $data['agents'] = $this->account->where('access', 'agent')->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE `completed` = 0
SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE `completed` = 1
SELECT COUNT(*) AS `numrows`
FROM `game_players`
WHERE `linked` = 0
SELECT COUNT(*) AS `numrows`
FROM `game_players`
WHERE `linked` = 1
SELECT *
FROM `game_players`
WHERE `linked` = 1
SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE `completed` = 0
AND `PLAYER_ID` = 'PLY202205233320'
---
            }
        }

        $data['current_trans_pending'] = $this->transaction->where("completed",0)->countAllResults();
        $data['current_trans_processed'] = $this->transaction->where("completed",1)->countAllResults();
        $data['game_players_pending'] = $this->gameplayer->where("linked",0)->countAllResults();
        $data['game_players_linked'] = $this->gameplayer->where("linked",1)->countAllResults();

        $all_linked_players = $this->gameplayer->where("linked",1)->find();
        $available_for_processing = 0;
        foreach ($all_linked_players as $k => $v) {
            $available = $this->transaction->where("completed",0)->where("PLAYER_ID", $v['game_player_id'])->countAllResults();