app/Controllers/Agent.php

SELECT *
FROM `accounts`
WHERE `accounts`.`id` = '16'
SELECT *
FROM `players`
WHERE `agent` = '16'
SELECT sum(amount) as total
FROM `commission`
WHERE `account_id` = '16'
AND `player_id` = 'PLY202212068728'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE `PLAYER_ID` = 'PLY202212068728'
---
    public function index($var)
    {
        if(!$this->logged){
            return redirect()->to('login');
        }

        $myData = $this->account->find($this->id);
        if($myData['phone'] == '') return redirect()->to('agent_profile');

        //update account wallet
        if($this->balance > $myData['wallet'] ){
            $this->account->save([
                "id" => $this->id,
                "wallet" => $this->balance
            ]);
        }

        $sub_menu = '';
        $view = $this->access . '/' . $var;


        $data = [
            "balance" => $this->balance,
            "id" => $this->id,
            "menu" => $var,
            "action" => $sub_menu
        ];

        if($var == 'players'){
            $list = [];
            foreach ( $this->player->where('agent', $this->id)->find() as $k => $v) {
                $v['commission'] = $this->wallet->where('account_id', $this->id)->where('player_id', $v['player_id'])->select('sum(amount) as total')->first()['total'] ?? 0;
                $v['transactions'] = $this->transaction->where('PLAYER_ID', $v['player_id'])->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `players`
WHERE `agent` = '6'
---
        }

        if($var == 'dashboard'){
            $data['players'] = $this->player->where('agent', $this->id)->countAllResults();

SELECT *
FROM `accounts`
WHERE `accounts`.`id` = '6'
---
    public function agent_profile(){
        if(!$this->logged){
            return redirect()->to('login');
        }

        $currentItem = $this->account->find($this->id);