app/Controllers/Dashboard.php

    public function logout()
    {
        $this->account->save([
            'id' => $this->id,
            'online' => 0,
        ]);
        $this->logs->save([
            'name' => 'logout',
            'info' => $this->access,
            'account_id' => $this->id,
        ]);
---
UPDATE `accounts` SET `online` = 0, `updated_at` = '2023-01-31 17:08:51'
WHERE `accounts`.`id` IN ('2')
INSERT INTO `logs` (`name`, `info`, `account_id`, `created_at`, `updated_at`) VALUES ('logout', 'admin', '2', '2023-01-31 17:08:51', '2023-01-31 17:08:51')