app/Controllers/Login.php




                $account = $this->account->where('email', $this->request->getVar('email'))->first();
---
SELECT *
FROM `accounts`
WHERE `email` = 'admin@mail.com'
 LIMIT 1

                    $savethis['status'] = 'active';
                }

                $this->account->save($savethis);
                $this->logs->save([
                    'name' => 'login',
                    'info' => $account['access'],
                    'account_id' => $account['id'],
                ]);
---
UPDATE `accounts` SET `online` = 1, `updated_at` = '2023-01-30 02:35:57'
WHERE `accounts`.`id` IN ('2')
INSERT INTO `logs` (`name`, `info`, `account_id`, `created_at`, `updated_at`) VALUES ('login', 'admin', '2', '2023-01-30 02:35:57', '2023-01-30 02:35:57')