app/Controllers/Payout.php

SELECT *
FROM `meta`
WHERE `name` = 'minimum_payout'
 LIMIT 1
SELECT *
FROM `accounts`
WHERE `access` = 'operator'
SELECT *
FROM `accounts`
WHERE `wallet` > '1'
AND `operator` = '9'
SELECT sum(wallet) as total
FROM `accounts`
WHERE `wallet` > '1'
AND `operator` = '9'
 LIMIT 1
SELECT *
FROM `accounts`
WHERE `wallet` > '1'
SELECT sum(wallet) as total
FROM `accounts`
WHERE `wallet` > '1'
 LIMIT 1
---
    public function index($var)
    {
        if(!$this->logged){
            return redirect()->to('login');
        }

        $sub_menu = $var ?? 'pending';
        $view = $this->access . '/' . $sub_menu . '_payouts';

        $minimum_payout = $this->meta->where('name', 'minimum_payout')->first()['value'];

        $data = [
            "balance" => $this->balance,
            "id" => $this->id,
            "menu" => 'payouts',
            "action" => $sub_menu,
            "operatorID" => false,
            "minimum_payout" => $minimum_payout
        ];

        $data['operators'] = $this->account->where('access', 'operator')->find();

        if($var == 'pending'){
            $list = [];
            $operatorID = $this->request->getVar('operator') ?? false;
            if($operatorID){
                $data['operatorID'] = $operatorID;
                $list = $this->account->where('wallet >', $minimum_payout)->where('operator', $operatorID)->find();
                $data['total_pending'] = $this->account->where('wallet >', $minimum_payout)->where('operator', $operatorID)->select('sum(wallet) as total')->first()['total'] ?? 0;
            }else {
                $list = $this->account->where('wallet >', $minimum_payout)->find();
                $data['total_pending'] = $this->account->where('wallet >', $minimum_payout)->select('sum(wallet) as total')->first()['total'] ?? 0;

SELECT *
FROM `accounts`
WHERE `accounts`.`id` = '6'
SELECT *
FROM `meta`
WHERE `name` = 'minimum_payout'
 LIMIT 1
---
    public function process_payout($id){
        if(!$this->logged){
            return redirect()->to('login');
        }

        $currentItem = $this->account->find($id) ?? [];
        $minimum_payout = $this->meta->where('name', 'minimum_payout')->first()['value'];

UPDATE `accounts` SET `wallet` = 493.50500000003, `updated_at` = '2023-01-31 17:08:23'
WHERE `accounts`.`id` IN ('6')
---
                ];

                $this->wallet->save($data);
                $this->account->save(['wallet' => ($currentItem['wallet'] - $payoutValue ), 'id' => $currentItem['id'] ]);